Revit 2024 API
StairsLanding.GetConnections Method
 Returns information about the connections in which the stairs landing participates.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public IList<StairsComponentConnection> GetConnections()
Visual Basic
Public Function GetConnections As IList(Of StairsComponentConnection)
Visual C++
public:
IList<StairsComponentConnection^>^ GetConnections()
Return Value
 The connections in which the stairs landing participates.
See Also
StairsLanding Class
Autodesk.Revit.DB.Architecture Namespace